//GOETZE1 JOB (),'ME',CLASS=A,TIME=1140,NOTIFY=&SYSUID
//PROCLIB JCLLIB ORDER=GOETZE1.JZOS.JCL
//*
//*********************************************************************
//*
//* Batch job to run sample batch programs with Java1.4 VM
//*
//* Tailor the proc and job for your installation:
//* 1.) Modify the Job card per your installation's requirements
//* 2.) Modify the PROCLIB card to point to your JZOS proclib
//* 3.) Modify APPL_HOME to point to the hfs directory where the
//*     application was deployed
//* 3.) Modify JZOS_HOME to point to the hfs directory where JZOS
//*     was installed
//* 4.) edit JAVA_HOME to point the location of the 1.4 JDK
//* 5.) Modify the CLASSPATH as required to point to your Java code
//* 6.) Modify JAVACLS and ARGS to launch desired Java class
//* 7.) Customize any DD statements required for the application
//*
//*********************************************************************
//*
//*
//JAVA EXEC PROC=EXJZOSVM,VERSION='14',
// JAVACLS='ZFileCopy'
//INPUT  DD DSN=SYS1.MACLIB(ACB),DISP=SHR
//OUTPUT DD SYSOUT=*
//STDENV DD *
# This is a shell script which configures
# any environment variables for the Java JVM.
# Variables must be exported to be seen by the launcher.

. /etc/profile
export JZOS_HOME=/dovetail/jzos
export APPL_HOME=/dovetail/jzos_samp
export JAVA_HOME=/usr/lpp/java/J1.4

export PATH="$PATH":"${JAVA_HOME}"/bin:

LIBPATH="$LIBPATH":"${JAVA_HOME}"/bin
LIBPATH="$LIBPATH":"${JAVA_HOME}"/bin/classic
LIBPATH="$LIBPATH":"${JZOS_HOME}"
export LIBPATH="$LIBPATH":

# Customize your CLASSPATH here
# Add application home directory and jars to CLASSPATH
CLASSPATH=${APPL_HOME}
for i in "${APPL_HOME}"/*.jar; do
    CLASSPATH="$CLASSPATH":"$i"
    done

# Add JZOS required jars to end of CLASSPATH
for i in "${JZOS_HOME}"/*.jar; do
    CLASSPATH="$CLASSPATH":"$i"
    done
export CLASSPATH="$CLASSPATH":

# Set JZOS specific options
# Use this variable to specify encoding for DD STDOUT and STDERR
#export JZOS_OUTPUT_ENCODING=Cp1047
# Use this variable to prevent JZOS from handling MVS operator commands
#export JZOS_ENABLE_MVS_COMMANDS=false
# Use this variable to supply additional arguments to main
#export JZOS_MAIN_ARGS=""

# Configure JVM options
IJO="-Xms16m -Xmx128m"
IJO="$IJO -Djzos.home=${JZOS_HOME}"
# Uncomment the following if you want to run without JIT
#IJO="$IJO -Djava.compiler=NONE"
# Uncomment the following if you want to run with Ascii file encoding..
#IJO="$IJO -Dfile.encoding=ISO8859-1"
export IBM_JAVA_OPTIONS="$IJO "

export JAVA_DUMP_HEAP=false
export JAVA_PROPAGATE=NO
export IBM_JAVA_ZOS_TDUMP=NO
//
